IdeaRS.Connections
Plate2PlateData Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.Plate2PlateData"]
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.ConnectionPartDataBase
 IdeaRS.Connections.Data.PlateDataBase
 IdeaRS.Connections.Data.EndPlateDataBase
 IdeaRS.Connections.Data.Plate2PlateData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class Plate2PlateData : EndPlateDataBase,
	IBoltableData
The Plate2PlateData type exposes the following members.
Constructors
Name | Description
Plate2PlateData
 Constructor
Top
Properties
Name | Description
Anchoring
 Gets or sets the properties of the anchoring
ConnectionType
 Gets or sets the type of connection of two parts.
 (Inherited from EndPlateDataBase.)
Fastening
 Gets or sets the properties of the anchoring
FlangesWeld
 Gets or sets the properties of the weld - flanges
InnerRadius
 Gets or sets the inner radius of the circular plate boundary.
 (Inherited from EndPlateDataBase.)
IsActive |  (Inherited from ConnectionCmdData.)
IsWeld
 If true welds are generated automatically
Member1
 Gets or sets the first connected member
Member2
 Gets or sets the second connected member
Name
 Gets or set the name
 (Inherited from ConnectionCmdData.)
OffsetBottom
 Gets or sets the bottom offset of the end plate boundary in the horizontal direction (the width of the plate). The size of the end plate is based on the circumscribed box of the column.
 (Inherited from EndPlateDataBase.)
OffsetLeft
 Gets or sets the left offset of the end plate boundary in the vertical direction (the height of the plate). The size of the end plate is based on the circumscribed box of the column.
 (Inherited from EndPlateDataBase.)
OffsetRight
 Gets or sets the right offset of the end plate boundary in the vertical direction (the height of the plate). The size of the end plate is based on the circumscribed box of the column.
 (Inherited from EndPlateDataBase.)
OffsetTop
 Gets or sets the top offset of the end plate boundary in the horizontal direction (the width of the plate). The size of the end plate is based on the circumscribed box of the column.
 (Inherited from EndPlateDataBase.)
OperationId
 Gets or sets the identifier of the operation in the manufacturer sequence
 (Inherited from ConnectionCmdData.)
OuterRadius
 Gets or sets the outer radius of the circular plate boundary.
 (Inherited from EndPlateDataBase.)
PlateMaterialName
 Gets or sets the name of the material If value is null or empty material is taken from column
 (Inherited from PlateDataBase.)
PlateSizeMethod
 Gets or sets the method of the definition of dimensions of the plate
 (Inherited from EndPlateDataBase.)
PositionOnMember1
 Gets or sets the position of the plate (measured on the reference line of the beam segment)
ShapeData
 Collection of plate editor data
 (Inherited from PlateDataBase.)
Thickness
 Gets or sets the thickness of the plate
 (Inherited from PlateDataBase.)
Weld
 Gets or sets the properties of the weld - other parts
Top
Methods
Name | Description
Equals
Determines whether the specified object is equal to the current object.
 (Inherited from Object.)
Finalize
Allows an object to try to free resources and perform other cleanup operations before it is reclaimed by garbage collection.
 (Inherited from Object.)
GetHashCode
Serves as the default hash function.
 (Inherited from Object.)
GetShallowCopy |  (Inherited from ConnectionCmdData.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
MemberwiseClone
Creates a shallow copy of the current Object.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Top
See Also
Reference
IdeaRS.Connections.Data Namespace